In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# ORDER BY
" order by절은 데이터를 정렬하는 절이고 select 문장에 맨 마지막에 기술함 "  
예:  
select ename, sal  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;from emp  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;order by sal asc;  
  
- sal: 정렬할 컬럼명
- asc: 정렬 방법( asc: 낮은 값으로부터 높은 값순으로 / desc: 높은 값으로부터 낮은 값 순으로 )

※ order by 절에는 컬럼을 여러개를 작성할 수 있다.  

select ename<<1>>, deptno<<2>>, sal<<3>>  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; from emp  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; order by <<2>> asc, <<3>> desc  

-> deptno가 먼저 정렬이 되고 그것들이 그룹화 되어 그룹한 채로 sal이 정렬이 됌

In [3]:
%%sql
select ename, deptno, sal
    from emp
    order by deptno asc, sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 10, Decimal('5000')),
 ('CLARK', 10, Decimal('2450')),
 ('MILLER', 10, Decimal('1300')),
 ('SCOTT', 20, Decimal('3000')),
 ('FORD', 20, Decimal('3000')),
 ('JONES', 20, Decimal('2975')),
 ('ADAMS', 20, Decimal('1100')),
 ('SMITH', 20, Decimal('800')),
 ('BLAKE', 30, Decimal('2850')),
 ('ALLEN', 30, Decimal('1600')),
 ('TURNER', 30, Decimal('1500')),
 ('MARTIN', 30, Decimal('1250')),
 ('WARD', 30, Decimal('1250')),
 ('JAMES', 30, Decimal('950'))]

문제 13. 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오!

In [5]:
%%sql

select ename, sal
    from emp
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('SCOTT', Decimal('3000')),
 ('FORD', Decimal('3000')),
 ('JONES', Decimal('2975')),
 ('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500')),
 ('MILLER', Decimal('1300')),
 ('WARD', Decimal('1250')),
 ('MARTIN', Decimal('1250')),
 ('ADAMS', Decimal('1100')),
 ('JAMES', Decimal('950')),
 ('SMITH', Decimal('800'))]

문제 14. 이름과 입사일을 출력하는데 최근에 입사한 사원부터 출력하시오

In [7]:
%%sql

select ename, hiredate
    from emp
    order by hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ADAMS', datetime.datetime(1983, 1, 15, 0, 0)),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0)),
 ('MILLER', datetime.datetime(1982, 1, 11, 0, 0)),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0)),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0)),
 ('KING', datetime.datetime(1981, 11, 17, 0, 0)),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0)),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0)),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0)),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('WARD', datetime.datetime(1981, 2, 23, 0, 0)),
 ('ALLEN', datetime.datetime(1981, 2, 11, 0, 0)),
 ('SMITH', datetime.datetime(1980, 12, 9, 0, 0))]

문제 15. 이름과 월급과 부서번호를 출력하는데 부서번호가 10번, 20번, 30번 순으로 출력되게 하고 컬럼명이 한글로 이름, 월급, 부서번호로 출력되게 하시오

In [11]:
%%sql
select ename "이름", sal "월급", deptno "부서번호"
    from emp
    order by deptno asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 10),
 ('CLARK', Decimal('2450'), 10),
 ('MILLER', Decimal('1300'), 10),
 ('ADAMS', Decimal('1100'), 20),
 ('SCOTT', Decimal('3000'), 20),
 ('SMITH', Decimal('800'), 20),
 ('FORD', Decimal('3000'), 20),
 ('JONES', Decimal('2975'), 20),
 ('WARD', Decimal('1250'), 30),
 ('JAMES', Decimal('950'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('BLAKE', Decimal('2850'), 30),
 ('TURNER', Decimal('1500'), 30)]

문제 15. 이름과 직업과 입사일을 출력하는데 직업은 ABCD 순으로 정렬해서 출력하고  
           직업을 ABCD 순으로 정렬한 걸 기준으로 입사일을 먼저 입사한 사원부터 출력되게 하시오

In [12]:
%%sql

select ename, job, hiredate
    from emp
    order by job asc, hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', 'ANALYST', datetime.datetime(1982, 12, 22, 0, 0)),
 ('FORD', 'ANALYST', datetime.datetime(1981, 12, 11, 0, 0)),
 ('ADAMS', 'CLERK', datetime.datetime(1983, 1, 15, 0, 0)),
 ('MILLER', 'CLERK', datetime.datetime(1982, 1, 11, 0, 0)),
 ('JAMES', 'CLERK', datetime.datetime(1981, 12, 11, 0, 0)),
 ('SMITH', 'CLERK', datetime.datetime(1980, 12, 9, 0, 0)),
 ('CLARK', 'MANAGER', datetime.datetime(1981, 5, 9, 0, 0)),
 ('BLAKE', 'MANAGER', datetime.datetime(1981, 5, 1, 0, 0)),
 ('JONES', 'MANAGER', datetime.datetime(1981, 4, 1, 0, 0)),
 ('KING', 'PRESIDENT', datetime.datetime(1981, 11, 17, 0, 0)),
 ('MARTIN', 'SALESMAN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('TURNER', 'SALESMAN', datetime.datetime(1981, 8, 21, 0, 0)),
 ('WARD', 'SALESMAN', datetime.datetime(1981, 2, 23, 0, 0)),
 ('ALLEN', 'SALESMAN', datetime.datetime(1981, 2, 11, 0, 0))]

# where 절
"Where 절을 사용하면 특정 조건에 대한 데이터만 선별해서 출력할 수 있다.
## 숫자 데이터 검색

In [29]:
%%sql
select ename, sal
from emp
where sal > 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'))]

문제 16. 사원번호가 7788 번인 사원의 사원번호와 이름과 월급을 출력하시요

In [30]:
%%sql

select ename, sal
    from emp
    where empno = 7788

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', Decimal('3000'))]

문제 17. 30번 부서번호에서 근무하는 사원들의 이름과 월급과 부서번호를 출력하시오

In [31]:
%%sql

select ename, sal, deptno
    from emp
    where deptno=30

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('TURNER', Decimal('1500'), 30),
 ('JAMES', Decimal('950'), 30),
 ('WARD', Decimal('1250'), 30)]

문제 18. 위 결과를 다시 출력하는데 월급이 높은 사원부터 출력하시오

In [32]:
%%sql

select ename, sal, deptno
    from emp
    where deptno=30
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('TURNER', Decimal('1500'), 30),
 ('WARD', Decimal('1250'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('JAMES', Decimal('950'), 30)]

※ order by 절은 맨 마지막에 작성  
   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 순서: select -> from -> where -> order by

문제 19. 부서번호가 20번인 사원들의 이름과 입사일과 부서번호를 출력하는데 최근에 입사한 사원부터 출력하시오

In [33]:
%%sql

select ename, hiredate, deptno
    from emp
    where deptno = 20
    order by hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ADAMS', datetime.datetime(1983, 1, 15, 0, 0), 20),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0), 20),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0), 20),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0), 20),
 ('SMITH', datetime.datetime(1980, 12, 9, 0, 0), 20)]

## 문자와 날짜 검색
"Where절로 데이터를 검색할 때 숫자와는 다르게 문자와 날짜는 싱글 퀘테이션 마크를 둘러야 합니다"

In [34]:
%%sql

select ename, sal
    from emp
    where ename='SCOTT'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', Decimal('3000'))]

※ SQL은 대소문자를 구분하지 않으나 데이터는 대소문자를 구분함  
※ 싱글 쿼테이션 마크안에 있는 데이터는 문자 또는 날짜 라는 것을 의미  
※ 날짜 검색을 할때는 년도/월/일 순으로 검색을 하면 되는데 나라마다 순서가 다를 수 있다.  
   미국이나 영국에서의 날짜 검색은 일/월/년도 순서입니다.

문제 20. 직업이 SALESMAN인 사원들의 이름과 월급과 직업을 출력하시오

In [36]:
%%sql

select ename, sal, job
    from emp
    where job = 'SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250'), 'SALESMAN'),
 ('ALLEN', Decimal('1600'), 'SALESMAN'),
 ('TURNER', Decimal('1500'), 'SALESMAN'),
 ('WARD', Decimal('1250'), 'SALESMAN')]

문제 21. 81년 11월 17일에 입사한 사원의 이름과 입사일을 출력하시오

In [37]:
%%sql

select ename, hiredate
    from emp
    where hiredate = '1981-11-17'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', datetime.datetime(1981, 11, 17, 0, 0))]

# 산술 연산자

문제22. 이름과 연봉(sal*12)을 출력하는데 컬럼명을 한글로 이름, 연봉으로 출력하시오

In [40]:
%%sql

select ename 이름, sal*12 연봉
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 60000),
 ('BLAKE', 34200),
 ('CLARK', 29400),
 ('JONES', 35700),
 ('MARTIN', 15000),
 ('ALLEN', 19200),
 ('TURNER', 18000),
 ('JAMES', 11400),
 ('WARD', 15000),
 ('FORD', 36000),
 ('SMITH', 9600),
 ('SCOTT', 36000),
 ('ADAMS', 13200),
 ('MILLER', 15600)]

문제23. 위의 결과를 다시 출력하는데 연봉이 36000인 사원들의 이름과 연봉을 출력하시오

In [44]:
%%sql
select ename 이름, sal*12 연봉
    from emp
    where sal*12 = 36000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('FORD', 36000), ('SCOTT', 36000)]

In [46]:
%%sql
select ename as 이름,  sal *12 as 연봉
                  from emp
                  where 연봉 = 36000

 * oracle://scott:***@localhost:1521/orcl

DatabaseError: (cx_Oracle.DatabaseError) ORA-00904: "연봉": 부적합한 식별자
[SQL: select ename as 이름,  sal *12 as 연봉
                  from emp
                  where 연봉 = 36000]
(Background on this error at: http://sqlalche.me/e/14/4xp6)

위의 SQL이 수행되지 않는 이유는 실행순서 때문  
코딩 순서: select ---> from ---> where ---> order by  
실행 순서: from ---> where ---> select ---> order by

문제 24. 이름과 연봉을 출력하는데 연봉이 가장 높은 사원부터 출력하시오!

In [48]:
%%sql

select ename 이름, sal * 12 연봉
    from emp
    order by 연봉 desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 60000),
 ('SCOTT', 36000),
 ('FORD', 36000),
 ('JONES', 35700),
 ('BLAKE', 34200),
 ('CLARK', 29400),
 ('ALLEN', 19200),
 ('TURNER', 18000),
 ('MILLER', 15600),
 ('WARD', 15000),
 ('MARTIN', 15000),
 ('ADAMS', 13200),
 ('JAMES', 11400),
 ('SMITH', 9600)]

문제 25. 아래의 SQL에서 더하기가 먼저 실행되게 하시오!   

Select ename, sal + 200 * 2   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;from emp;

In [50]:
%%sql
select ename, (sal + 200) * 2
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 10400),
 ('BLAKE', 6100),
 ('CLARK', 5300),
 ('JONES', 6350),
 ('MARTIN', 2900),
 ('ALLEN', 3600),
 ('TURNER', 3400),
 ('JAMES', 2300),
 ('WARD', 2900),
 ('FORD', 6400),
 ('SMITH', 2000),
 ('SCOTT', 6400),
 ('ADAMS', 2600),
 ('MILLER', 3000)]

# 비교 연산자
- !=, <>,^= 같지 않다.(3가지 뭘써도 관계 없다)|

문제 26. 커미션이 150 이상인 사원들의 이름과 커미션을 출력하시오

In [52]:
%%sql

select ename, comm
    from emp
    where comm >= 150

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1400')),
 ('ALLEN', Decimal('300')),
 ('WARD', Decimal('500'))]

문제 27. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오!

In [53]:
%%sql

select ename, sal
    from emp
    where sal > 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'))]

문제 28. 직업이 SALESMAN 이 아닌 사원들의 이름과 직업을 출력하시오

In [55]:
%%sql

select ename, job
    from emp
    where job != 'SALESMAM'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'PRESIDENT'),
 ('BLAKE', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('JONES', 'MANAGER'),
 ('MARTIN', 'SALESMAN'),
 ('ALLEN', 'SALESMAN'),
 ('TURNER', 'SALESMAN'),
 ('JAMES', 'CLERK'),
 ('WARD', 'SALESMAN'),
 ('FORD', 'ANALYST'),
 ('SMITH', 'CLERK'),
 ('SCOTT', 'ANALYST'),
 ('ADAMS', 'CLERK'),
 ('MILLER', 'CLERK')]

※ 문자와 날짜는 반드시 양쪽에 싱글 쿼에티션 마크를 둘러줘여 한다.  
&nbsp;&nbsp;&nbsp; 더블 쿼테이션 마크는 오라클 전체를 통틀어서 딱 하나의 케이스  
&nbsp;&nbsp;&nbsp; 컬럼 별칭을 사용할 때 공백문자, 특수문자, 대소문자를 구분해서 컬럼 별칭을 출력하고자 할 때만 사용

문제 29. 월급이 2400 이하인 사원들의 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오

In [56]:
%%sql

select ename, sal
    from emp
    where sal <= 2400
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500')),
 ('MILLER', Decimal('1300')),
 ('MARTIN', Decimal('1250')),
 ('WARD', Decimal('1250')),
 ('ADAMS', Decimal('1100')),
 ('JAMES', Decimal('950')),
 ('SMITH', Decimal('800'))]

문제 30. 월급이 1000에서 3000 사이인 사원들의 이름과 월급을 출력하시오

In [60]:
%%sql

select ename, sal
    from emp
    where sal >= 1000 and sal < 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850')),
 ('CLARK', Decimal('2450')),
 ('JONES', Decimal('2975')),
 ('MARTIN', Decimal('1250')),
 ('ALLEN', Decimal('1600')),
 ('TURNER', Decimal('1500')),
 ('WARD', Decimal('1250')),
 ('ADAMS', Decimal('1100')),
 ('MILLER', Decimal('1300'))]

문제 31. 월급이 1000에서 3000 사이가 아닌 사원들의 이름과 월급을 출력하시오

In [63]:
%%sql

select ename, sal
    from emp
    where sal not between 1000 and 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('JAMES', Decimal('950')),
 ('SMITH', Decimal('800'))]

## like
※ like는 ~일 것 같은 / ~처럼 이라는 영어의 뜻처럼 이름의 첫번째 철자가 S로 시작한다라는 뜻이다.  
 &nbsp;&nbsp;&nbsp; %는 와일드 카드로 이 자리에 뭐가 와도 관계가 없다라는 뜻  
 &nbsp;&nbsp;&nbsp; 그 철자의 갯수가 몇개가 되도 관계없다는 뜻임  
 &nbsp;&nbsp;&nbsp; %가 와일드 카드의 역할을 하기 위해선 무조건 like가 앞에 와야 한다  
 &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; where ename = 's% => 이경우 이름에 s%가 들어간 사람만을 찾는다.
 
<br>

※ like와 같이 쓸 수 있는 키워드 2개
- % 와일드 카드: 이 자리에 뭐가 와도 관계 없고 그 갯수가 몇개가 되던 관계가 없다.
- _ 언더바: 이 자리에 뭐가 와도 관계 없는데 자릿수는 한개여야 한다.

문제 33. 이름의 끝 글자가 T로 끝나는 사원들의 이름을 출력하시오

In [66]:
%%sql

select ename
    from emp
    where ename like '%T'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT',)]

문제 34. 81년도에 입사한 사원들의 이름과 입사일을 출력하는데 between and 를 사용하지 말고 like 로 하시오

In [68]:
%%sql

select ename, hiredate
    from emp
    where hiredate like '81%'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', datetime.datetime(1981, 11, 17, 0, 0)),
 ('BLAKE', datetime.datetime(1981, 5, 1, 0, 0)),
 ('CLARK', datetime.datetime(1981, 5, 9, 0, 0)),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0)),
 ('MARTIN', datetime.datetime(1981, 9, 10, 0, 0)),
 ('ALLEN', datetime.datetime(1981, 2, 11, 0, 0)),
 ('TURNER', datetime.datetime(1981, 8, 21, 0, 0)),
 ('JAMES', datetime.datetime(1981, 12, 11, 0, 0)),
 ('WARD', datetime.datetime(1981, 2, 23, 0, 0)),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0))]

문제 35. 이름의 두번째 철자가 M인 사원들의 이름을 출력하시오

In [70]:
%%sql

select ename
    from emp
    where ename like '_M%'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH',)]

문제 36. 이름의 세번째 철자가 A인 사원들의 이름을 출력하시오

In [72]:
%%sql
select ename
    from emp
    where ename like '__A%'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE',), ('CLARK',), ('ADAMS',)]